experiments_old/04_heartbeat_realistic_pressure/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Pressure-driven pulsatile flow: velocity is NOT prescribed at the boundary.
// The parabolic profile develops naturally from the time-varying pressure
// gradient set in 0/p.
//
// Boundary condition strategy (0/p):
//   p_outlet(t) = Murgo aortic waveform (80–120 mmHg) — physiological reference
//   p_inlet(t)  = p_outlet(t) + Δp(t) [Hagen-Poiseuille pulsatile gradient]
//   Δp(t) = 0.1056 · [0.1375 + 0.1125·sin(2πt/T − π/2)]  m²/s²
//         → same pulsatile velocity as Exp 02/03, at physiological absolute pressure.
//
// Expected steady periodic state (Hagen-Poiseuille, pressure-driven):
//   Δp_peak = 40 mmHg → U_center_peak ≈ R²·Δp_peak / (4·mu·L) [m/s]
//   Re_peak (laminar ✓)
//
// Initial condition (t=0): parabolic profile at time-averaged centreline velocity
// to minimise start-up transient.
//   Ux(y,z) = 0.275 · (1 − (y² + z²) / R²)   R = 0.005 m
//   Q_init  ≈ 10.8 mL/s  (= approximate time-averaged flow rate)

dimensions      [0 1 -1 0 0 0 0];

internalField   #codeStream
{
    codeInclude
    #{
        #include "fvCFD.H"
    #};

    codeOptions
    #{
        -I$(LIB_SRC)/finiteVolume/lnInclude \
        -I$(LIB_SRC)/meshTools/lnInclude
    #};

    codeLibs
    #{
        -lfiniteVolume \
        -lmeshTools
    #};

    code
    #{
        const IOdictionary& d = static_cast<const IOdictionary&>(dict);
        const fvMesh& mesh = refCast<const fvMesh>(d.db());

        const scalar R       = 0.005;   // vessel radius [m]
        const scalar Ucenter = 0.275;   // mean centreline velocity [m/s] (time-averaged)

        vectorField field(mesh.nCells(), vector::zero);
        forAll(mesh.C(), i)
        {
            const scalar y  = mesh.C()[i].y();
            const scalar z  = mesh.C()[i].z();
            const scalar r2 = y*y + z*z;
            field[i] = vector(Ucenter*(1.0 - r2/(R*R)), 0, 0);
        }
        field.writeEntry("", os);
    #};
};

boundaryField
{
    inlet
    {
        // Velocity develops freely from the pressure gradient.
        type            zeroGradient;
    }

    outlet
    {
        // Allow flow to exit without constraining the velocity profile.
        type            zeroGradient;
    }

    wall
    {
        type            noSlip;
    }
}

// ************************************************************************* //
